/*
 --------------------------------------
 ID

 --------------------------------------
 1       : バックグラウンド画像
 2       : 白黒スイッチボタン
 3       : Reset button
 4       : Undo button
 11 - 88 : マス目番号
   11 12 ... 18
   21 22 ... 28
   ...  ... ...
   81 82 ... 88

 111 - 188 : 各マスにおける黒の画像
 211 - 288 : 各マスにおける白の画像

 900 : text, black
 901 : text, white
 902 : text, 1st player
 903 : text, 2nd player
 904 : text, win or lose
 --------------------------------------
*/

/*
 --------------------------------------
 status[8][8]

 --------------------------------------
 -1 : vis   button
 0  : invis button
 1  : vis black
 2  : vis white
 --------------------------------------
*/

/*
 --------------------------------------
 ReversiDirection[8][8][8]

 --------------------------------------
 [i][j][0] : right
 [i][j][1] : upper right
 [i][j][2] : up
 [i][j][3] : upper left
 [i][j][4] : left
 [i][j][5] : lower left
 [i][j][6] : low
 [i][j][7] : lower right

 0  : その方向はひっくり返せない
 1  : ひっくり返せる
 --------------------------------------
*/
